Revit 2027 API
ParameterTypeId.StructuralConnectionOverrideType Property
 "Override by Instance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralConnectionOverrideType { get; }
Public Shared ReadOnly Property StructuralConnectionOverrideType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralConnectionOverrideType {
	ForgeTypeId^ get ();
}
static member StructuralConnectionOverrideType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace